In [1]:
import numpy as np
import pandas as pd
import warnings 
warnings.filterwarnings('ignore')

In [2]:
df=pd.read_csv("course.csv")

In [3]:
df.head()   #gives 1st 5 records

   1     Mumbai       PQR institute .Pvt            BI  MH   9 Months
0  2      Delhi   ABC institute .Pvt.LTD            AI  UP  18 Months
1  3  Bengaluru      MNO  institute .Ltd  Data Science  TN  11 Months
2  4     Bhopal  RST  institute .Pvt.LTD            ML  MP   3 Months
3  5     Mumbai  EFG  institute .Pvt.LTD            DL  MH   3 Months
4  6  Hyderabad          LMN  institute          Could  AP   4 Months

## adding col name/header:

In [8]:
header=['sr no','city','coaching centre','courses','states','course duration']

df=pd.read_csv('course.csv',names=header)

In [9]:
df.head()

,sr no,city,coaching centre,courses,states,course duration
0,1,Mumbai,PQR institute .Pvt,BI,MH,9 Months
1,2,Delhi,ABC institute .Pvt.LTD,AI,UP,18 Months
2,3,Bengaluru,MNO institute .Ltd,Data Science,TN,11 Months
3,4,Bhopal,RST institute .Pvt.LTD,ML,MP,3 Months
4,5,Mumbai,EFG institute .Pvt.LTD,DL,MH,3 Months

## b.selecting a col:

1.) dot notation

2.) brackets

In [10]:
df.city.head()

0       Mumbai
1        Delhi
2    Bengaluru
3       Bhopal
4       Mumbai
Name: city, dtype: object

In [11]:
df['course duration'].head()

0     9 Months
1    18 Months
2    11 Months
3     3 Months
4     3 Months
Name: course duration, dtype: object

## c.) adding new cols:

In [13]:
location=df['city']+' '+df['states']

In [14]:
location

0        Mumbai MH
1         Delhi UP
2     Bengaluru TN
3        Bhopal MP
4        Mumbai MH
5     Hyderabad AP
6         Patna BH
7       Channai KT
8       Kolkata WB
9     Hyderabad AP
10       Bhopal MP
11         Pune MH
12        Delhi UP
13       Mumbai MH
14        Patna BH
15        Surat GJ
16        Delhi UP
17       Mumbai MH
18         Pune MH
19    Bengaluru TN
20        Surat Gj
21    Hyderabad AP
22       Mumbai MH
23      Channai KT
24        Patna BH
dtype: object

In [15]:
df['location']=location

In [16]:
df.head()

,sr no,city,coaching centre,courses,states,course duration,location
0,1,Mumbai,PQR institute .Pvt,BI,MH,9 Months,Mumbai MH
1,2,Delhi,ABC institute .Pvt.LTD,AI,UP,18 Months,Delhi UP
2,3,Bengaluru,MNO institute .Ltd,Data Science,TN,11 Months,Bengaluru TN
3,4,Bhopal,RST institute .Pvt.LTD,ML,MP,3 Months,Bhopal MP
4,5,Mumbai,EFG institute .Pvt.LTD,DL,MH,3 Months,Mumbai MH

## d.)delete cols:

In [17]:
df.drop(['city','states'],axis='columns',inplace=True)

In [18]:
df.head()

   sr no          coaching centre       courses course duration      location
0      1       PQR institute .Pvt            BI        9 Months     Mumbai MH
1      2   ABC institute .Pvt.LTD            AI       18 Months      Delhi UP
2      3      MNO  institute .Ltd  Data Science       11 Months  Bengaluru TN
3      4  RST  institute .Pvt.LTD            ML        3 Months     Bhopal MP
4      5  EFG  institute .Pvt.LTD            DL        3 Months     Mumbai MH

## e.) setting new index:

In [20]:
df.set_index('courses',inplace=True)

In [21]:
df.head()

              sr no          coaching centre course duration      location
courses
BI                1       PQR institute .Pvt        9 Months     Mumbai MH
AI                2   ABC institute .Pvt.LTD       18 Months      Delhi UP
Data Science      3      MNO  institute .Ltd       11 Months  Bengaluru TN
ML                4  RST  institute .Pvt.LTD        3 Months     Bhopal MP
DL                5  EFG  institute .Pvt.LTD        3 Months     Mumbai MH

## f.) reseting index:

In [23]:
#df.index.name='courses'
df.reset_index(inplace=True)

In [24]:
df.head()

        courses  sr no          coaching centre course duration      location
0            BI      1       PQR institute .Pvt        9 Months     Mumbai MH
1            AI      2   ABC institute .Pvt.LTD       18 Months      Delhi UP
2  Data Science      3      MNO  institute .Ltd       11 Months  Bengaluru TN
3            ML      4  RST  institute .Pvt.LTD        3 Months     Bhopal MP
4            DL      5  EFG  institute .Pvt.LTD        3 Months     Mumbai MH

In [25]:
type(df)

pandas.core.frame.DataFrame

In [26]:
type(df.location)

pandas.core.series.Series